#include<stdio.h>
int main(){
    int x = 100;
    int *p = NULL;
    printf("val of x %d\n", x);
    printf("val of p %d\n", *p);
/*
     seg fault again
    যখন আমরা `int *p = NULL;` লিখি, তখন এর মানে দাঁড়ায় `p = 0`,
     অর্থাৎ পয়েন্টার `p` কোনো বৈধ ভেরিয়েবলের অ্যাড্রেস ধরে রাখেনি বরং এটি `NULL` নির্দেশ করছে।
     এখন `*p` ব্যবহারের অর্থ হলো `p`-এর ভেতরের অ্যাড্রেসে গিয়ে সেখান থেকে মান পড়া;
     কিন্তু এখানে `p` যেহেতু `NULL` (বা অ্যাড্রেস 0), তাই `*p` কার্যত অ্যাড্রেস 0-এর মেমোরি থেকে মান পড়ার চেষ্টা করে।
     যেহেতু এটি কোনো বৈধ মেমোরি অ্যাক্সেস নয়, তাই এটি সিস্টেমে ত্রুটি ঘটিয়ে **Segmentation Fault** তৈরি করে।
*/
}